app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("attuid", "created_at", "password", "updated_at") VALUES (?, ?, ?, ?)  [["attuid", "mr5081"], ["created_at", "2014-07-24 02:01:21.611890"], ["password", "123"], ["updated_at", "2014-07-24 02:01:21.611890"]]